Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionRadial Class
 The CurvedDimensionRadial class defines a curved dimension with radial reference points. The dimension text on the line can be either a distance or an angle value.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionBase
 Tekla.Structures.Drawing.CurvedDimensionBase
 Tekla.Structures.Drawing.CurvedDimensionRadial
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CurvedDimensionRadial : CurvedDimensionBase
<SerializableAttribute>
Public NotInheritable Class CurvedDimensionRadial
	Inherits CurvedDimensionBase
The CurvedDimensionRadial type exposes the following members.
Constructors
Name | Description
CurvedDimensionRadial(ViewBase, Point, Point, Point, Point, Point, Double)
 Creates a new curved dimension with radial reference points using standard attributes.
CurvedDimensionRadial(ViewBase, Point, Point, Point, Point, Point, Double, CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes)
 Creates a new curved dimension with radial reference points.
Top
Properties
Name | Description
ArcPoint1
 Gets the first arc point.
 (Inherited from CurvedDimensionBase.)
ArcPoint2
 Gets the second arc point.
 (Inherited from CurvedDimensionBase.)
ArcPoint3
 Gets the third arc point.
 (Inherited from CurvedDimensionBase.)
Attributes
 Gets or sets the curved dimension set base attributes.
 (Inherited from CurvedDimensionBase.)
Distance
 Gets the distance.
 (Inherited from CurvedDimensionBase.)
EndPoint
 The end point of the dimension.
 (Inherited from CurvedDimensionBase.)
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from DimensionBase.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
StartPoint
 The start point of the dimension.
 (Inherited from CurvedDimensionBase.)
Top
Methods
Name | Description
Delete
 Deletes the straight dimension from the database.
 (Inherited from CurvedDimensionBase.)
GetDimensionSet()
 Gets the dimension set the current dimension belongs to.
 (Inherited from CurvedDimensionBase.)
GetDimensionSet(Boolean)
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDrawing
 Gets the drawing where the drawing object is.
 (Inherited from DrawingObject.)
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetRelatedObjects()
 Gets the related objects of the current object.
 (Inherited from DrawingObject.)
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
 (Inherited from DrawingObject.)
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetView
 Gets the view where the drawing object is.
 (Inherited from DrawingObject.)
Insert
 Inserts the dimension to the database.
 (Inherited from CurvedDimensionBase.)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides CurvedDimensionBase.IsEqual(Object).)
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Inherited from DatabaseObject.)
Modify
 The single dimension cannot be modified.
 (Inherited from CurvedDimensionBase.)
Select
 Selects the straight dimension from the database.
 (Inherited from CurvedDimensionBase.)
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
ToString
 Changes the string presentation of the drawing object.
 (Inherited from DrawingObject.)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace